### Part 3
9/7/23
Kass Doran 

Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project and wants you to create a MySQL database for them.

- Normalize the tables before adding them to your new database
- Keep TMDB API in 1 table together 
- Only need imdb_id, revenue, budget, and certification columns

They want the data from the following files included in your database:

Title Basics:
- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres (split into two columns)
    - genre_id
    - genre_name
- title_genres (split into two columns)
    - tconst
    - genre_id
- drop the following columns:
    - "original_title" 
    - "isAdult" 
    - "titleType" 
    - "genres" and other variants of genre

Title Ratings
 - Movie ID (tconst)
 - Average Movie Rating
 - Number of Votes

The TMDB API Results (multiple files)
- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)

### Import Data

In [36]:
#Imports
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [37]:
##log into my sql

In [38]:
##Load in data sets
#Title_basics
title_basics = pd.read_csv('Data/title_basics_final.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [39]:
##Load in data sets
#Title_ratings
title_ratings = pd.read_csv('Data/title_ratings_final.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87452
1  tt0062336            6.4       179
2  tt0068865            5.4        74
3  tt0069049            6.7      7811
4  tt0088751            5.2       339

In [40]:
##Load in data sets
#TMDB_2000 movies
df_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
df_2000.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.450,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2302.0,PG

In [41]:
##Load in data sets
#TMDB_2001 movies
df_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
df_2001.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.331,1219.0,PG-13
2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,The Dark Mist,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG
4,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,...,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.442,130.0,PG-13

In [42]:
#Concatenate TMDB files into one dataframe
tmdb_df = pd.concat((df_2000, df_2001))
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2598 entries, 0 to 1345
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2598 non-null   object
 1   adult                  2596 non-null   float64
 2   backdrop_path          1442 non-null   object
 3   belongs_to_collection  211 non-null    object
 4   budget                 2596 non-null   float64
 5   genres                 2596 non-null   object
 6   homepage               170 non-null    object
 7   id                     2596 non-null   float64
 8   original_language      2596 non-null   object
 9   original_title         2596 non-null   object
 10  overview               2553 non-null   object
 11  popularity             2596 non-null   float64
 12  poster_path            2354 non-null   object
 13  production_companies   2596 non-null   object
 14  production_countries   2596 non-null   object
 15  release_date           2575 non-null   object
 16  revenue                2596 non-null   float64
 17  runtime                2596 non-null   float64
 18  spoken_languages       2596 non-null   object
 19  status                 2596 non-null   object
 20  tagline                1121 non-null   object
 21  title                  2596 non-null   object
 22  video                  2596 non-null   float64
 23  vote_average           2596 non-null   float64
 24  vote_count             2596 non-null   float64
 25  certification          817 non-null    object
dtypes: float64(9), object(17)
memory usage: 548.0+ KB

In [92]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Kassie18*" # (whatever password you chose during mysql installation)
db_name = "Project3-3"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)

In [93]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

Database created!

### Title Basics

Title Basics:

- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)


- Genres (split into two columns)
  - genre_id
  - genre_name
  
  
title_genres (split into two columns)
  - tconst
  - genre_id
  
  
drop the following columns:

- "original_title"
- "isAdult"
-  "titleType"
- "genres" and other variants of genre

In [47]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81882 entries, 0 to 81881
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81882 non-null  object
 1   titleType       81882 non-null  object
 2   primaryTitle    81882 non-null  object
 3   originalTitle   81882 non-null  object
 4   isAdult         81882 non-null  int64
 5   startYear       81882 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81882 non-null  int64
 8   genres          81882 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.6+ MB

In [50]:
#Drop columns from tmbd_data
title_basics_filtered = title_basics.drop(columns = ['titleType','originalTitle','isAdult',"endYear"])
#Verify the drop
title_basics_filtered.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81882 entries, 0 to 81881
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81882 non-null  object
 1   primaryTitle    81882 non-null  object
 2   startYear       81882 non-null  float64
 3   runtimeMinutes  81882 non-null  int64
 4   genres          81882 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.1+ MB

In [51]:
title_basics_filtered.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0068865,Lives of Performers,2016.0,90,Drama
3,tt0069049,The Other Side of the Wind,2018.0,122,Drama
4,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"

In [54]:
## create a col with a list of genres
title_basics_filtered['genres_split'] = title_basics_filtered['genres'].str.split(',')
title_basics_filtered

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0068865,Lives of Performers,2016.0,90,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...
81877,tt9914942,Life Without Sara Amat,2019.0,74,Drama,[Drama]
81878,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81879,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
81880,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81881,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

In [59]:
exploded_genres = title_basics_filtered.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0068865,Lives of Performers,2016.0,90,Drama,Drama
...,...,...,...,...,...,...
81880,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
81880,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
81880,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
81881,tt9916362,Coven,2020.0,92,"Drama,History",Drama
81881,tt9916362,Coven,2020.0,92,"Drama,History",History

In [57]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [73]:
#Make new integer column in title_genres table
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = 'genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [74]:
#Convert genre map dictionary into genres table
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                      'Genre_ID': genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [94]:
from sqlalchemy.types import *

#Calculate max string lengths for object columns
id_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(id_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [95]:
#Save table to sql
title_basics.to_sql('title_basics', engine, dtype = basics_schema, 
                    if_exists = 'replace', index = False)

81882

## Title Ratings
- Movie ID (tconst)
- Average Movie Rating
- Number of Votes

In [96]:
#Calculate max string lengths for object columns
id_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(id_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [97]:
#Save table to sql
title_ratings.to_sql('title_ratings', engine, dtype = ratings_schema, 
                    if_exists = 'replace', index = False)

68057

In [98]:
#Add tconst as primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [99]:
#Query to run first five rows of title_basics table
q = """
SELECT *
FROM title_ratings
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     87452
1  tt0062336            6.4       179
2  tt0068865            5.4        74
3  tt0069049            6.7      7811
4  tt0088751            5.2       339


### The TMDB API Results (multiple files)

- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)

In [103]:
#Drop first row
tmdb_data = tmdb_data.drop([0])
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.450,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2302.0,PG
5,tt0118852,0.0,/vceiGZ3uavAEHlTA7v0GjQsGVKe.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.642,53.0,R

In [104]:
#Calculate max string lengths for object columns
id_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(id_len+1),
    'budget':Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}

In [105]:
#Save table to sql
tmdb_data.to_sql('tmdb_data', engine, dtype = tmdb_schema, 
                    if_exists = 'replace', index = False)

2596

In [106]:
#Add imdb_id as primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [107]:
#Final query
#Show tables in database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_project3-3
0         title_basics
1        title_ratings
2            tmdb_data